
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СписокДоступныхУстройств = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам("ЭквайринговыйТерминал");
	
	Если СписокДоступныхУстройств.Количество() = 0 Тогда
		Сообщить("Для рабочего места не настроен эквайринговый терминал", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	СписокУстройств = Новый СписокЗначений();
	Для Каждого Устройства Из СписокДоступныхУстройств Цикл
		СписокУстройств.Добавить(Устройства.Ссылка, Устройства.Наименование);
	КонецЦикла;
	
	Если СписокУстройств.Количество() = 1 Тогда
		Идентификатор = СписокУстройств[0].Значение;
	КонецЕсли;

	ВыходныеПараметры = Неопределено;
	ВходныеПараметры  = Новый Массив();
	ВходныеПараметры.Добавить("BigReport"); 
	Оповещение = Новый ОписаниеОповещения("ДополнительноеДействиеЗавершение", ЭтотОбъект);
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор");
	Результат.Вставить("ПараметрыОборудования");
	

	МенеджерОборудованияКлиент.НачатьВыполнениеДополнительнойКоманды(Оповещение, "DoAdditionalAction", ВходныеПараметры, Идентификатор,  Результат);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноеДействиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	ТекстСообщения = ?(РезультатВыполнения.Результат,  НСтр("ru = 'Операция выполнена успешно.'"),
	                               НСтр("ru = 'Ошибка выполнения операции.'") + Символы.НПП + РезультатВыполнения.ВыходныеПараметры[1] + "Закройте Рабочее окно кассира");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
КонецПроцедуры

