
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СисИнфо = Новый СистемнаяИнформация;
	Если Лев(СисИнфо.ВерсияПриложения, 3) = "8.3" Тогда
		Элементы.ЗначениеПоУмолчанию.КнопкаВыпадающегоСписка = Истина;
		Элементы.НастройкаЗагрузки.КнопкаВыпадающегоСписка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("Источник", "ФормаВыбораЗначенияПоУмолчанию");
	СтруктураОповещения.Вставить("ЗначениеПоУмолчанию", ЗначениеПоУмолчанию);
	СтруктураОповещения.Вставить("НастройкаЗагрузки", НастройкаЗагрузки);
	СтруктураОповещения.Вставить("ЗаголовокНастройкиЗагрузки", Элементы.НастройкаЗагрузки.ТекстРедактирования);	
	ОповеститьОВыборе(СтруктураОповещения);
	
КонецПроцедуры


