// Инициализирует документ
//
Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Организация 	= ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
		
	Ответственный 	= Пользователи.ТекущийПользователь();
		
КонецПроцедуры // ИнициализироватьДокумент()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.АЭС_МатрицаСкладовПоПриоритетам.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	АЭС_ДвиженияДокументов.ОтразитьМатрицуПриоритетовСкладов(ДополнительныеСвойства, Движения, Отказ);
	АЭС_ДвиженияДокументов.ОтразитьАктуальныеПриоритетыСкладов(ДополнительныеСвойства, Движения, Отказ);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	//
	//Если НЕ Отказ Тогда
	//	
	//	Документы.АЭС_ТоварныеПредложения.ЗарегистрироватьТорговыеПредложенияДлявыгрузки(Ссылка);
	//				
	//КонецЕсли; // Если НЕ Отказ Тогда
	
	
			
КонецПроцедуры // Процедура ОбработкаПроведения(Отказ, РежимПроведения)

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры // Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

