
Функция ПолучитьСоединениеСБазойКолцентра(КодНастройки)
	
	СтруктураНастроек = АЭС_Стек.ПолучитьНастройкиСоединенияSQL(КодНастройки);
	
	Если СтруктураНастроек = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не СтруктураНастроек.РазрешитьЧтение Тогда
		Сообщить("Чтение из колл-центра не разрешено!");
		Возврат Неопределено;
	КонецЕсли;
	
	
	//Попытка
	//	//Provider=SQLOLEDB.1
	//	Соединение = Новый COMОбъект("ADODB.Connection");
	//	Соединение.Open("Provider="		+ СтруктураНастроек.ИмяПровайдера + ";
	//	|Persist Security Info=False;
	//	|User ID="			+ СтруктураНастроек.ИмяПользователя + ";
	//	|Password="			+ СтруктураНастроек.ПарольПользователя + ";
	//	|Initial Catalog="	+ СтруктураНастроек.ИмяБазы + ";
	//	//|=" + СтруктураНастроек. + ";
	//	|Data Source="		+ СтруктураНастроек.АдресСервера + ";");
	//Исключение
	//	Сообщить(ОписаниеОшибки());
	//	Соединение = Неопределено;
	//КонецПопытки;
	//
	//Если Соединение = Неопределено Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ИмяДрайвера			= ?(ЗначениеЗаполнено(СтруктураНастроек.ИмяПровайдера), СтруктураНастроек.ИмяПровайдера, "MySQL ODBC 3.51 Driver");
	АдресСервера		= СтруктураНастроек.АдресСервера;
	ИмяБазы				= СтруктураНастроек.ИмяБазы;
	ИмяПользователя		= СтруктураНастроек.ИмяПользователя;
	ПарольПользователя	= СтруктураНастроек.ПарольПользователя;
	Попытка
		
		Соединение = Новый COMОбъект("ADODB.Connection");
		//СтрокаСоединенияСАстерискСервером   =  
		//"DRIVER={MySQL ODBC 5.3 ANSI Driver};SERVER=10.46.2.66;Port=3306;DATABASE=atomcc;UID=user1c;PWD=Fj4Fdjf4bs;";
		//|Option=3;";
		//СтрокаСоединенияСАстерискСервером   = 	"DRIVER={MySQL ODBC 3.51 Driver};SERVER=10.46.2.66;Port=3306;DATABASE=atomcc;UID=user1c;PWD=Fj4Fdjf4bs;";
		СтрокаСоединенияСАстерискСервером   = 	"DRIVER={" + ИмяДрайвера + "};SERVER=" + АдресСервера + ";Port=3306;DATABASE=" + ИмяБазы + ";UID=" + ИмяПользователя + ";PWD=" + ПарольПользователя + ";";
		
		Соединение.ConnectionString = СтрокаСоединенияСАстерискСервером;
		
		//     |Persist Security Info=False;
//                                 driver={SQL Server};
		Соединение.Open();
		//"DRIVER={MySQL Driver};
		//				|SERVER=10.46.2.66;
		//				|UID=user1c;
		//				|PWD=Fj4Fdjf4bs;
		//				|DATABASE=atomcc;");
		//Сообщить("подключено");
	Исключение
		Сообщить(ОписаниеОшибки());
		Соединение = Неопределено;
	КонецПопытки;

	Возврат Соединение;
	
КонецФункции

Функция ПолучитьНеобработанныеОбращения(Соединение = Неопределено) Экспорт

	Если Соединение = Неопределено Тогда
		Соединение = ПолучитьСоединениеСБазойКолцентра("КЦ")
	КонецЕсли;
	
	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	Попытка
		//Сообщить("Выполнение запроса");
		Команда = Новый COMОбъект("ADODB.Command");
		Команда.ActiveConnection = Соединение;
		Команда.CommandType = 1; //вызываем таб.функцию как запрос   use atomcc;|
		
		
		Команда.CommandText = "set names cp1251;";
		Команда.Execute();
		
		Команда.CommandText = "call getAppeals(5, 0);";
		
		ЗаписиSQL = Команда.Execute();
		
		Если ЗаписиSQL.EOF() Тогда
			//убрать за собой
			ЗаписиSQL = Неопределено;
			Команда = Неопределено;
			//Сообщить("Запрос не вернул ни одной строки", СтатусСообщения.Важное);
			Возврат Неопределено; // ошибка 
		КонецЕсли;
		
		ТЗ = Новый ТаблицаЗначений;
		
		ТЗ.Колонки.Добавить("id");
		ТЗ.Колонки.Добавить("theme_id");
		ТЗ.Колонки.Добавить("text");
		ТЗ.Колонки.Добавить("comment");
		ТЗ.Колонки.Добавить("user_phone");
		ТЗ.Колонки.Добавить("email");
		ТЗ.Колонки.Добавить("operator_login");
		ТЗ.Колонки.Добавить("operator_phone");
		ТЗ.Колонки.Добавить("region_id");
		ТЗ.Колонки.Добавить("ls");
		ТЗ.Колонки.Добавить("address");
		ТЗ.Колонки.Добавить("channel_id");
		ТЗ.Колонки.Добавить("external_id");
		ТЗ.Колонки.Добавить("c1_external_id");
		ТЗ.Колонки.Добавить("status_id");
		ТЗ.Колонки.Добавить("created_at");
		ТЗ.Колонки.Добавить("updated_at");
		ТЗ.Колонки.Добавить("completion_date");
		ТЗ.Колонки.Добавить("answer_id");
		
		Пока ЗаписиSQL.EOF() = 0 Цикл
			
			НовСтр = ТЗ.Добавить();
			НовСтр.id 				=	ЗаписиSQL.Fields("id").Value;
			НовСтр.theme_id			=	ЗаписиSQL.Fields("theme_id").Value;
			//!!!!НовСтр.text 			=	ЗаписиSQL.Fields("text").Value;
			НовСтр.comment			=	ЗаписиSQL.Fields("comment").Value;
			НовСтр.user_phone		=	ЗаписиSQL.Fields("user_phone").Value;
			НовСтр.email			=	ЗаписиSQL.Fields("email").Value;
			НовСтр.operator_login	=	ЗаписиSQL.Fields("operator_login").Value;
			//НовСтр.operator_phone	=	ЗаписиSQL.Fields("operator_phone").Value;
			НовСтр.region_id		=	ЗаписиSQL.Fields("region_id").Value;
			НовСтр.ls				=	ЗаписиSQL.Fields("ls").Value;
			НовСтр.address		 	=	ЗаписиSQL.Fields("address").Value;
			НовСтр.channel_id		=	ЗаписиSQL.Fields("channel_id").Value;
			//НовСтр.external_id	 	=	ЗаписиSQL.Fields("external_id").Value;
			НовСтр.c1_external_id	=	ЗаписиSQL.Fields("1c_external_id").Value;
			НовСтр.status_id		=	ЗаписиSQL.Fields("status_id").Value;
			НовСтр.created_at		=	ЗаписиSQL.Fields("created_at").Value;
			НовСтр.updated_at		=	ЗаписиSQL.Fields("updated_at").Value;
			НовСтр.completion_date	=	ЗаписиSQL.Fields("completion_date").Value;
			НовСтр.answer_id		=	ЗаписиSQL.Fields("answer_id").Value;
			
			//ЗаписиSQL.Fields(0).Name
			ЗаписиSQL.MoveNext();	
		КонецЦикла;
		
		Возврат ТЗ;
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;


КонецФункции // ПолучитьНеобработанныеОбращения()

