//&НаСервере

//Функция СведенияОВнешнейОбработке() Экспорт
//	ДанныеДляРег = Новый Структура();
//	ДанныеДляРег.Вставить("Наименование", "Аналог Z-отчета");
//	ДанныеДляРег.Вставить("БезопасныйРежим", Истина);
//	ДанныеДляРег.Вставить("Версия", "ver.: 0.001");
//	ДанныеДляРег.Вставить("Информация", "Аналог Z-отчета с возможностью формирования за произвольный период");
//		ДанныеДляРег.Вставить("Вид", "ДополнительнаяОбработка");
//		ТабЗнКоманды = Новый ТаблицаЗначений;
//		ТабЗнКоманды.Колонки.Добавить("Идентификатор");
//		ТабЗнКоманды.Колонки.Добавить("Использование");
//		ТабЗнКоманды.Колонки.Добавить("Представление");
//		НовСтрока = ТабЗнКоманды.Добавить();
//		НовСтрока.Идентификатор = "ОткрытьОбработку";
//		НовСтрока.Использование = "ОткрытиеФормы";
//		НовСтрока.Представление = "Открыть Аналог Z-отчета";   //     Открыть Аналог Z-отчета
//		ДанныеДляРег.Вставить("Команды", ТабЗнКоманды);
//		Возврат ДанныеДляРег;
//	КонецФункции
