
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//лПараметры = СтроковыеФункцииКлиентСервер.ПолучитьПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
	лПараметры = СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
	
	//Возврат;
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ИмяТекБазы = "Файловая";//назовем ее так
	Иначе
		ИмяТекБазы = СокрЛП(НРег(лПараметры.Ref));
	КонецЕсли;
	
	
	Если Найти(НРег(ИмяТекБазы), "test") > 0 Тогда
		Отладка = Истина;
	Иначе
		Отладка = Ложь;
	КонецЕсли;
	
	Объект.Отладка = Отладка;
	Элементы.Отладка.Видимость = Отладка;
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьЧекиККМНаСервере()
	
	ЧекККМ = Неопределено;
	//Элементы.ЧекиККМ.ВыделенныеСтроки.ЧекККМ;
	Для Каждого Эл Из Элементы.ЧекиККМ.ВыделенныеСтроки Цикл
		АЭС_Стек.ВыгрузитьПлатежВСтек(Эл.Платеж, Эл.НомерСтрокиТЧ, , Объект.Отладка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЧекиККМ(Команда)
	
	
	//Элементы.ЧекиККМ.ВыделенныеСтроки
	ВыгрузитьЧекиККМНаСервере();
	//ОбновитьОтображениеДанных();
	Элементы.ЧекиККМ.Обновить();
КонецПроцедуры
