
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДанныеВыбора = Новый Массив;
	ДанныеВыбора.Добавить(Перечисления.ОтветственныеЛицаОрганизаций.Исполнитель);
	ДанныеВыбора.Добавить(Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаБухгалтерскиеРегистры);
	ДанныеВыбора.Добавить(Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаВУР);
	ДанныеВыбора.Добавить(Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаНалоговыеРегистры);
	ДанныеВыбора.Добавить(Перечисления.ОтветственныеЛицаОрганизаций.УполномоченныйПредставитель);
	ДанныеВыбора.Добавить(Перечисления.ОтветственныеЛицаОрганизаций.ТоварныйОтчет);
	Элементы.ОтветственноеЛицо.СписокВыбора.ЗагрузитьЗначения(ДанныеВыбора);	
КонецПроцедуры
