
Процедура ПередЗаписью(Отказ)
	
	Если ФормироватьЗаданияПользователям И ЭтотОбъект.Пользователи.Количество() = 0 Тогда
		
		Отказ = Истина;
		Сообщить("Установлен параметр: формировать задания пользователям, заполните пользователей на вкладке ""Пользователи""");
		
	КонецЕсли; // Если ФормироватьЗаданияПользователям И ЭтотОбъект.Пользователи.Количество() = 0 Тогда	
	
	РазничныйЕсть	= ЭтотОбъект.Склады.Найти(Истина,"Розничный");
	
	Если РазничныйЕсть = Неопределено Тогда
		
		Сообщить("Розничный склад не определен, установите признак ""Розничный"" у розничного склада на вкладке ""Склады");
		Отказ = Истина;
			
	КонецЕсли; // Если НЕ РазничныйЕсть Тогда
	
КонецПроцедуры // Процедура ПередЗаписью(Отказ)
