////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура устанавливает текст надписи текста выражения
//
&НаКлиенте
Процедура УстановитьНадписьТекстВыражения()
	
	Если РежимЗагрузки = 1 ИЛИ РежимЗагрузки = 5 ИЛИ РежимЗагрузки = 3 Тогда
		
		Если Элементы.ГруппаПанель.ТекущаяСтраница.Имя = "ГруппаПослеДобавленияСтроки" Тогда
			
			НадписьТекстВыражения =
				"В тексте выражения можно использовать следующие предопределенные параметры:
				|   Объект         - Записываемый объект
				|   ТекущиеДанные  - Содержит данные загружаемой строки табличной части.
				|   ТекстыЯчеек    - массив текстов ячеек строки
				|Встроенные функции, функции общих модулей.";
		Иначе
			
			НадписьТекстВыражения =
				"В тексте выражения можно использовать следующие предопределенные параметры:
				|   Объект         - Записываемый объект
				|   Отказ          - Признак отказа от записи объекта
				|Встроенные функции, функции общих модулей.";
			
		КонецЕсли;
		
	ИначеЕсли РежимЗагрузки =0 Тогда
		
		Если Элементы.ГруппаПанель.ТекущаяСтраница.Имя = "ГруппаПослеЗаписиОбъекта" Тогда
			НадписьТекстВыражения =
				"В тексте выражения можно использовать следующие предопределенные параметры:
				|   Объект         - Записываемый объект
				|   Отказ          - Признак отказа от записи объекта
				|   СписокОбъектов - Список значений в котором находятся ссылки на доплнительно загружаемые справочники.
				|Встроенные функции, функции общих модулей.";
		Иначе	
			НадписьТекстВыражения =
				"В тексте выражения можно использовать следующие предопределенные параметры:
				|   Объект         - Записываемый объект
				|   Отказ          - Признак отказа от записи объекта
				|   ТекстыЯчеек    - массив текстов ячеек строки
				|Встроенные функции, функции общих модулей.";
		КонецЕсли;
		
	ИначеЕсли РежимЗагрузки =2 Тогда
		НадписьТекстВыражения =
		"В тексте выражения можно использовать следующие предопределенные параметры:
		|   Объект         - Менеджер записи регистра сведений
		|   Отказ          - Признак отказа от записи объекта
		|   ТекстыЯчеек    - массив текстов ячеек строки
		|Встроенные функции, функции общих модулей.";
	КонецЕсли;
	
КонецПроцедуры // ()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если РежимЗагрузки = 2 Тогда
		Элементы.ГруппаПанель.ПодчиненныеЭлементы.ГруппаПередЗаписьюОбъекта.Заголовок = "Перед записью";
		Элементы.ГруппаПанель.ПодчиненныеЭлементы.ГруппаПриЗаписиОбъекта.Заголовок =    "При записи";
	КонецЕсли;
	
	Элементы.ГруппаПослеДобавленияСтроки.Видимость = ((РежимЗагрузки = 1) ИЛИ (РежимЗагрузки = 5) ИЛИ (РежимЗагрузки = 3));
	Элементы.ГруппаПослеЗаписиОбъекта.Видимость = (РежимЗагрузки = 0);
	УстановитьНадписьТекстВыражения();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Процедура - обаботчик события, при нажатии на кнопку "ОК" Командной панели "ОсновныеДействияФормы"
//
&НаКлиенте
Процедура ОсновныеДействияФормыОК(Команда)
	ОповеститьОВыборе(Новый Структура("Источник, Результат, ПередЗаписьюОбъекта, ПриЗаписиОбъекта, ПослеДобавленияСтроки, ПослеЗаписиОбъекта", 
	"ФормаРедактированияСобытий", Истина, ПередЗаписьюОбъекта.ПолучитьТекст(), ПриЗаписиОбъекта.ПолучитьТекст(), ПослеДобавленияСтроки.ПолучитьТекст(), ПослеЗаписиОбъекта.ПолучитьТекст()));
КонецПроцедуры

// Процедура - обаботчик события "ПриСменеСтраницы" в: Панель "Панель"
//
&НаКлиенте
Процедура ПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	УстановитьНадписьТекстВыражения();
КонецПроцедуры

