&НаСервере
Процедура ЗарегистрироватьДокументыДляОбмена(ПараметрКоманды)
	
	Документы.АЭС_ТоварныеПредложения.ЗарегистрироватьТорговыеПредложенияДлявыгрузки(ПараметрКоманды);
	
КонецПроцедуры // Процедура ЗарегистрироватьДокументыДляОбмена(ПараметрКоманды)	

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗарегистрироватьДокументыДляОбмена(ПараметрКоманды)	
			
КонецПроцедуры // Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
