
&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("Источник", "ФормаДобавленияДополнительнойНастройки");
	СтруктураВыбора.Вставить("Значение", ДобавляемыйОбъект);
	СтруктураВыбора.Вставить("Представление", Элементы.ДобавляемыйОбъект.ТекстРедактирования);
	СтруктураВыбора.Вставить("ЭтоРегистр", ЭтоРегистр);
	СтруктураВыбора.Вставить("ЗагружаетсяДоОбъекта", ЗагружаетсяДоОбъекта);
	
	ОповеститьОВыборе(СтруктураВыбора);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СисИнфо = Новый СистемнаяИнформация;
	Если Лев(СисИнфо.ВерсияПриложения, 3) = "8.3" Тогда
		Элементы.ДобавляемыйОбъект.КнопкаВыпадающегоСписка = Истина;
	КонецЕсли;
	
КонецПроцедуры

