Процедура АЭС_ПередЗаписьюЭлементаСправочникаПередЗаписью(Источник, Отказ) Экспорт
	
	Возврат;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиент Тогда
	
	ТипЗначенияИсточника = ТипЗнч(Источник);
	
	Если ТипЗначенияИсточника = Тип("СправочникОбъект.Контрагенты") Тогда
		
		Если Ложь Тогда Источник = Справочники.Контрагенты.СоздатьЭлемент(); КонецЕсли;
		
	ИначеЕсли ТипЗначенияИсточника = Тип("СправочникОбъект.Пользователи") Тогда 
		
		Если Ложь Тогда Источник = Справочники.Пользователи.СоздатьЭлемент(); КонецЕсли;
		
	//ИначеЕсли ТипЗначенияИсточника = Тип("СправочникОбъект.") Тогда
	
	КонецЕсли;
	#КонецЕсли	
	
КонецПроцедуры

// функция возвращает Истина если лимит превышен
// Дополнительно красит элемент формы в желтый/красный цвет
// С параметром Форма функция вызывается из формы Контрагента и АЭС_Платежи
// без параметра - при записи АЭС_Платежи
Функция ПревышенЛимитНаличныхПлатежей(СуммаКассовыхПлатежей, Форма = Неопределено) Экспорт
	
	Результат = Ложь;
	
	Если Форма <> Неопределено Тогда
		Элементы = Форма.Элементы;
		Объект = Форма.Объект;
	КонецЕсли;
	
	Если СуммаКассовыхПлатежей > 100000 Тогда
		ТекстСообщения = "Внимание! Сумма кассовых платежей превышает лимит (" + Формат(СуммаКассовыхПлатежей, "ЧГ=3,0") + ")";
		
		Если Форма <> Неопределено Тогда
			 ТекстСообщения = ТекстСообщения + " - : " + Строка(Объект.Ссылка);
			 //Объект.Контрагент.НомерЛС + ", ИНН: " + Объект.Контрагент.ИНН + ", " + Объект.Контрагент.Партнер;
		КонецЕсли;
		
		Сообщить(ТекстСообщения);
		АЭС_Сервер.СообщениеАдминистратору(ТекстСообщения);
	КонецЕсли;
	
	Если СуммаКассовыхПлатежей >= 100000 Тогда
		Если Форма <> Неопределено Тогда
			Элементы.СуммаКассовыхПлатежей.ЦветФона = WebЦвета.Красный;
		КонецЕсли;
		Результат = Истина;
	ИначеЕсли СуммаКассовыхПлатежей > 90000 Тогда
		Если Форма <> Неопределено Тогда
			Элементы.СуммаКассовыхПлатежей.ЦветФона = WebЦвета.Желтый;
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат Результат;
	
	
КонецФункции

Функция ПолучитьСуммаКассовыхПлатежей(ТаблицаСтатуса) Экспорт
	
	СуммаКассовыхПлатежей = 0;
	
	Для Каждого стрТЗ Из ТаблицаСтатуса Цикл
		Если ЗначениеЗаполнено(стрТЗ.НомерДоговора) Тогда
			СуммаКассовыхПлатежей = СуммаКассовыхПлатежей + стрТЗ.СуммаКассовыхПлатежей;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СуммаКассовыхПлатежей;
	
КонецФункции
