Процедура ОтразитьТорговыеПредложения(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПредложений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаАЭС_ТорговыеПредложения;
	
	Если Отказ ИЛИ ТаблицаПредложений.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; // Если Отказ ИЛИ ТаблицаПредложений.Количество() = 0 Тогда
	
	ДвиженияПредложения = Движения.АЭС_ТорговыеПредложения;
	ДвиженияПредложения.Записывать = Истина;
	ДвиженияПредложения.Загрузить(ТаблицаПредложений);
	
КонецПроцедуры

Процедура ОтразитьМатрицуПриоритетовСкладов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПредложений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаАЭС_ПриоритетыСкладов;
	
	Если Отказ ИЛИ ТаблицаПредложений.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; // Если Отказ ИЛИ ТаблицаПредложений.Количество() = 0 Тогда
	
	ДвиженияПредложения = Движения.АЭС_ПриоритетыСкладов;
	ДвиженияПредложения.Записывать = Истина;
	ДвиженияПредложения.Загрузить(ТаблицаПредложений);
	
КонецПроцедуры

Процедура ОтразитьАктуальныеПриоритетыСкладов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПредложений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаАЭС_АктуальныеПриоритеты;
	
	Если Отказ ИЛИ ТаблицаПредложений.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; // Если Отказ ИЛИ ТаблицаПредложений.Количество() = 0 Тогда
		
	ДвиженияПредложения = Движения.АЭС_АктуальныеПриоритеты;
	ДвиженияПредложения.Записывать 	= Истина;
	ДвиженияПредложения.Загрузить(ТаблицаПредложений);
	
КонецПроцедуры


