
&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Поставщик	= (Объект.ТипОперации	= Перечисления.АЭС_ВидТорговогоПредложения.Поставщик);
	Консигнация	= (Объект.ТипОперации	= Перечисления.АЭС_ВидТорговогоПредложения.Консигнация);
	Атом		= (Объект.ТипОперации	= Перечисления.АЭС_ВидТорговогоПредложения.Атом);
	
	Элементы.Контрагент.Видимость				= НЕ Атом;
	Элементы.т_НоменклатураПоставщика.Видимость	= Поставщик;
	Элементы.БизнесРегион.Видимость				= НЕ Поставщик;
	
	Элементы.ГруппаСтраницы.ТолькоПросмотр	= Объект.ЗапрещеноИзменять;
		
КонецПроцедуры // Процедура УстановитьВидимостьДоступность()	

&НаСервере
Процедура ЗаполнитьТоварыНаСервере(ТипЗаполнения)
		
	Товары	= Документы.АЭС_ТоварныеПредложения.ЗаполнитьТовары(ТипЗаполнения,Объект.ТипОперации,Объект.Организация,Объект.Контрагент,Объект.Дата,Объект.БизнесРегион);
	
	Объект.Товары.Загрузить(Товары);
	
КонецПроцедуры // Процедура ЗаполнитьТоварыНаСервере(ТипЗаполнения)

&НаКлиенте
Процедура ЗаполнитьТовары(ТипЗаполнения)
	
	Если Объект.Товары.Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект,ТипЗаполнения), НСтр("ru = 'Перед заполнением список товаров будет очищен. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли; // Если Объект.Товары.Количество() > 0 Тогда
	
	ЗаполнитьТоварыНаСервере(ТипЗаполнения);
	
КонецПроцедуры // Процедура ЗаполнитьТовары(ТипЗаполнения)

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Объект.Товары.Очистить();
    Иначе
        Возврат;
    КонецЕсли; // Если Ответ = КодВозвратаДиалога.Да Тогда
	
	ЗаполнитьТоварыНаСервере(ДополнительныеПараметры);

КонецПроцедуры // Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	УстановитьВидимостьДоступность();	
	
КонецПроцедуры // Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

&НаКлиенте
Процедура ВидТорговогоПредложенияПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры // Процедура ВидТорговогоПредложенияПриИзменении(Элемент)

&НаКлиенте
Процедура ЗполнитьПоТипуОперации(Команда)
	
	ЗаполнитьТовары("1")	
	
КонецПроцедуры // Процедура ЗполнитьПоТипуОперации(Команда)

&НаКлиенте
Процедура ЗполнитьПоРегиону(Команда)
	
	ЗаполнитьТовары("2")	
	
КонецПроцедуры // Процедура ЗполнитьПоРегиону(Команда)

&НаКлиенте
Процедура ЗаполнитьПоМатрице(Команда)
	
	ЗаполнитьТовары("3")	
	
КонецПроцедуры // Процедура ЗаполнитьПоМатрице(Команда)



