
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

&НаКлиенте
// Процедура - обработчик события "Нажатие" в: Кнопка "ОК"
//
Процедура ОКНажатие(Команда)
	
	нСтруктура = Новый Структура;
	нСтруктура.Вставить("Источник", "ФормаСохраненияНастроек");
	нСтруктура.Вставить("СписокНастроек", Элементы.СписокНастроек.ТекущиеДанные);
	
	ОповеститьОВыборе(нСтруктура);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Нажатие" в: Кнопка "Удалить"
//
Процедура УдалитьНажатие(Команда)
	
	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СоздавалиНовуюСтроку и ТекущиеДанные = СписокНастроек[СписокНастроек.Количество() - 1] Тогда
		СоздавалиНовуюСтроку = Ложь;
	КонецЕсли;
	
	Если СписокНастроек.Количество() = 1 Тогда
		СоздавалиНовуюСтроку = Истина;
		ТекущиеДанные.Представление = "";
		ТекущиеДанные.Пометка = Ложь;
	Иначе
		УдалитьНастройку(ТекущиеДанные.Представление);
		Оповестить("УдаленаНастройка", ТекущиеДанные.Представление);
		СписокНастроек.Удалить(ТекущиеДанные);	
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
// Процедура - обработчик окончания ввода наименования настройки
//
Процедура НаименованиеНастройкиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Нашли = Ложь;
	
	Для каждого ТекущиеДанные Из СписокНастроек Цикл
		Если ТекущиеДанные.Представление = Текст Тогда
			Нашли = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Нашли Тогда
		
		Если Не СоздавалиНовуюСтроку Тогда
			ТекущиеДанные = СписокНастроек.Добавить();
			СоздавалиНовуюСтроку = истина;
		Иначе
			ТекущиеДанные = СписокНастроек[СписокНастроек.Количество() - 1];
		КонецЕсли;
		
		ТекущиеДанные.Представление = Текст;
	КонецЕсли;
	
	Элементы.СписокНастроек.ТекущаяСтрока = СписокНастроек.Индекс(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик изменения настройки по умолчанию
//
Процедура СписокНастроекПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;
	Оповестить("УстановленаНастройкаПоУмолчанию", Новый Структура("Представление, Пометка", ТекущиеДанные.Представление, ТекущиеДанные.Пометка));
	Если ТекущиеДанные.Пометка Тогда
		Для каждого ЭлементСписка Из СписокНастроек Цикл
			Если ЭлементСписка.Пометка и Не ЭлементСписка = ТекущиеДанные Тогда
				ЭлементСписка.Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик выбора настройки
//
Процедура СписокНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	нСтруктура = Новый Структура;
	нСтруктура.Вставить("Источник", "ФормаСохраненияНастроек");
	нСтруктура.Вставить("СписокНастроек", Элементы.СписокНастроек.ТекущиеДанные);
	
	ОповеститьОВыборе(нСтруктура);	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
// Процедура удаляет настройку из Хранилища настроек форм
//
Процедура УдалитьНастройку(Представление)
	
	ХранилищеНастроекДанныхФорм.Удалить(ИдентификаторОбработки, "Настройки:" + Представление, Неопределено);
	
КонецПроцедуры
