Функция ПолучитьОтветственногоИДолжность(Подразделение, ДатаОкончания, Руководитель)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АЭС_ОтветственныеЛицаОрганизацииСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	АЭС_ОтветственныеЛицаОрганизацииСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.АЭС_ОтветственныеЛицаОрганизации.СрезПоследних(
		|			&Дата,
		|			Подразделение В (&Подразделение)
		|				И ОтветственноеЛицо = &Ответственный) КАК АЭС_ОтветственныеЛицаОрганизацииСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ДатаОкончания);
	Запрос.УстановитьПараметр("Ответственный", Руководитель);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ОтветственнойЛицо = Новый Структура;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОтветственнойЛицо.Вставить("ФИО", ВыборкаДетальныеЗаписи.ФизЛицо);
		ОтветственнойЛицо.Вставить("Должность", ВыборкаДетальныеЗаписи.Должность);
	КонецЦикла;
	Возврат ОтветственнойЛицо; 	

КонецФункции